tests/load/jmeter_turns_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  Plan de prueba JMeter — Turns App
  Endpoints públicos: GET /  |  GET /login  |  GET /register

  Uso (línea de comandos — NO abrir en GUI para resultados confiables):

    SMOKE (5 usuarios, 30s rampa, 60s total):
      jmeter -n -t tests/load/jmeter_turns_test.jmx \
        -JVUS=5 -JRAMP=30 -JDURATION=60 \
        -l tests/results/jmeter/smoke/results.jtl \
        -e -o tests/results/jmeter/smoke/html

    LOAD (50 usuarios, 60s rampa, 300s total):
      jmeter -n -t tests/load/jmeter_turns_test.jmx \
        -JVUS=50 -JRAMP=60 -JDURATION=300 \
        -l tests/results/jmeter/load/results.jtl \
        -e -o tests/results/jmeter/load/html

    STRESS (200 usuarios, 300s rampa, 600s total):
      jmeter -n -t tests/load/jmeter_turns_test.jmx \
        -JVUS=200 -JRAMP=300 -JDURATION=600 \
        -l tests/results/jmeter/stress/results.jtl \
        -e -o tests/results/jmeter/stress/html

  Parámetros:
    -JVUS       Cantidad de usuarios virtuales concurrentes
    -JRAMP      Tiempo en segundos para llegar al máximo de usuarios
    -JDURATION  Duración total de la prueba en segundos
    -l          Archivo .jtl donde se guardan los resultados crudos
    -e -o       Genera dashboard HTML en el directorio indicado
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>

    <!-- ═══════════════════════════════════════════════════════════════════
         TEST PLAN
         serialize_threadgroups=false porque solo tenemos un thread group
    ═══════════════════════════════════════════════════════════════════ -->
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="Turns App — Endpoints Públicos" enabled="true">
      <stringProp name="TestPlan.comments">Smoke / Load / Stress via propiedades -JVUS -JRAMP -JDURATION</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                   guiclass="ArgumentsPanel" testclass="Arguments"
                   testname="Variables globales" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>

    <hashTree>

      <!-- ─────────────────────────────────────────────────────────────
           HTTP REQUEST DEFAULTS
           Define host y puerto una sola vez para todos los samplers.
           Si cambiás el puerto, solo tocás aquí.
      ───────────────────────────────────────────────────────────────── -->
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement"
                         testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                     guiclass="HTTPArgumentsPanel" testclass="Arguments"
                     testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
        <stringProp name="HTTPSampler.port">8001</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        <boolProp name="HTTPSampler.image_parser">false</boolProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- ─────────────────────────────────────────────────────────────
           HTTP HEADER MANAGER
           Simula un navegador real. Laravel necesita Accept text/html
           para devolver la vista en vez de un error.
      ───────────────────────────────────────────────────────────────── -->
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                     testname="HTTP Headers" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="Accept" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</stringProp>
          </elementProp>
          <elementProp name="Accept-Language" elementType="Header">
            <stringProp name="Header.name">Accept-Language</stringProp>
            <stringProp name="Header.value">es-CO,es;q=0.8,en;q=0.5</stringProp>
          </elementProp>
          <elementProp name="User-Agent" elementType="Header">
            <stringProp name="Header.name">User-Agent</stringProp>
            <stringProp name="Header.value">Mozilla/5.0 (JMeter Load Test)</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <!-- ─────────────────────────────────────────────────────────────
           THREAD GROUP
           VUS, RAMP y DURATION vienen de propiedades de línea de
           comandos (-JVUS=5, etc.). Si no se pasan, usan los defaults
           del smoke test (5 / 30 / 60).

           loops=-1 con scheduler=true significa "correr hasta que
           se cumpla DURATION", sin un número fijo de iteraciones.
      ───────────────────────────────────────────────────────────────── -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="Usuarios Concurrentes" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController"
                     testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(VUS,5)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(RAMP,30)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(DURATION,60)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>

      <hashTree>

        <!-- ── Pausa entre peticiones (500 ms) ──────────────────────
             ConstantTimer en el scope del ThreadGroup aplica antes
             de CADA sampler dentro del grupo. Simula que el usuario
             tarda medio segundo en "hacer clic" en el siguiente link.
        ────────────────────────────────────────────────────────────── -->
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer"
                       testname="Pausa 500ms entre peticiones" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
        </ConstantTimer>
        <hashTree/>

        <!-- ── Sampler 1: GET / ──────────────────────────────────── -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="GET /" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                       guiclass="HTTPArgumentsPanel" testclass="Arguments"
                       testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Verificar HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Se esperaba HTTP 200 en GET /</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- ── Sampler 2: GET /login ─────────────────────────────── -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="GET /login" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                       guiclass="HTTPArgumentsPanel" testclass="Arguments"
                       testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/login</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Verificar HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Se esperaba HTTP 200 en GET /login</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- ── Sampler 3: GET /register ──────────────────────────── -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="GET /register" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments"
                       guiclass="HTTPArgumentsPanel" testclass="Arguments"
                       testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/register</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Verificar HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Se esperaba HTTP 200 en GET /register</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- ── Colector de resultados (.jtl) ─────────────────────────
             Guarda TODAS las peticiones en un archivo CSV-like.
             La ruta viene de la opción -l en la línea de comandos,
             así que este filename actúa solo como fallback de GUI.
        ────────────────────────────────────────────────────────────── -->
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector"
                         testname="Guardar resultados .jtl" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>